{
    "work":[
        {
            "from":"April 2025",
            "to":"current",
            "title":"Software Engineer II",
            "location":"Minneapolis, Minnesota, USA",
            "image":"/kognitiv_edge.jpg",
            "institution":"Kognitiv Edge",
            "experiences": [
                "Delivered performance-focused End-of-Training reports, emphasizing key metrics and trends in Special Forces training programs.",
                "Built a performant location API with Rust and Rocket powering various frontend location-based features and functionality",
                "Led critical updates to the Hyper-Enabled Instructor Platform’s data model leveraging Microsoft Dataverse and TypeScript to support evolving application needs.",
                "Maintained and published a suite of internal npm packages for KE using NX to streamline monorepo management.",
                "Azure, TypeScript, TerraForm, Microsoft Dataverse, Jest, Powerapps, and some Rust."
            ]
        },
        {
            "from":"April 2023",
            "to":"April 2025",
            "title":"Software Engineer (contracting)",
            "location":"Indianapolis, IN, USA",
            "image":"/tcs_logo.jpg",
            "institution": "Tata Consultancy Services (Eli Lilly & Company Contractor)",
            "experiences": [
                "Developed multi-lingual support for customer search application using React.js",
                "Automated pipelines that processed, stored, and shared user consent data with third parties (Glue, Lambda, boto3, pandas)",
                "Redesigned error handling logic for profile and data ingestion processes, significantly reducing ticket volume and improving error analysis (PostgreSQL, Lambda, psycopg2).",
                "Generated insightful business reports using for customers opting out of Lilly's Preference Center communications (Athena, Python3, Lambda)",
                "Leveraged CI/CD pipelines with AWS Cloudformation for all project deliverables.",
                "Python3, Next.js, React.js, Boto3, AWS Athena, Lambda, Glue, S3, DynamoDB, Pandas, SNS, SQS"
            ]
        },
        {
            "from":"January 2022",
            "to":"January 2023",
            "image":"/tcs_logo.jpg",
            "title":"Devops Engineer (contracting)",
            "location":"Remote",
            "institution": "Tata Consultancy Services (Hudson Bay Contractor)",
            "experiences": [
                "Maintained ASP.NET codebase that tracks associate performance for the Saks Fifth Avenue retail store.",
                "Conducted data cross-referencing using MSSQL 2008 providing specific datasets to internal Saks Fifth employees.",
                "Scheduled and executed batch jobs using BlueZone mainframe to process daily commissions sales for retail.",
                "ASP.NET, C#, MSSQL 2008, GitHub, SQL Server, BlueZone mainframe"
            ]
        }
    ],

    "education": [
        {
            "from": "September 2017",
            "to":" September 2021",
            "title": "Bachelor of Science",
            "institution":"Illinois State University",
            "image":"/ISU.jpg",
            "location":"Bloomington, Normal",
            "experiences":[
                "Majored in computer science",
                "Dean's List - 2021 and 2022."
            ]
        },
        {
            "from": "December 2021",
            "to": "December 2024",
            "image":"/google.jpg",
            "title": "Associate Cloud Engineer Certified",
            "institution":"Google Cloud Platform",
            "location":"",
            "experiences":[
                "Ability to deploy and secure applications, services, and infrastructure on Google Cloud Platform.",
                "Certified to work with public clouds and on-premises solutions."
            ]
        },
        {
            "from": "May 2025",
            "to": "November 2025",
            "image":"/usaf.png",
            "title": "For contracting with United States Air Force",
            "institution":"Common Access Card Holder",
            "location":"",
            "experiences":[
                "Security credential for United States Department of defense, granting authorized access to sensitive information and government facilities."
            ]
        }
    ]
}